# Pandas (2)

Материалы:
* Макрушин С.В. "Лекция 2: Библиотека Pandas"
* https://pandas.pydata.org/docs/user_guide/index.html#
* https://pandas.pydata.org/docs/reference/index.html

## Задачи для совместного разбора

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# Clone the entire repo.
!git clone -l -s https://github.com/BNik2001/Big-data-processing-technologies.git
%cd /content/Big-data-processing-technologies/Pandas/sem/data
!ls

Cloning into 'Big-data-processing-technologies'...
warning: --local is ignored
remote: Enumerating objects: 92, done.
remote: Counting objects: 100% (92/92), done.
remote: Compressing objects: 100% (74/74), done.
remote: Total 92 (delta 18), reused 57 (delta 8), pack-reused 0
Unpacking objects: 100% (92/92), done.
/content/Big-data-processing-technologies/Pandas/sem/data
recipes_sample.csv  reviews_sample.csv	sp500hst.txt  sp_data2.csv

1. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

In [ ]:
sp500 = pd.read_csv('sp500hst.txt', sep=",")
sp500.columns = ["date", "ticker", "open", "high", "low", "close", "volume"]
sp500

            date ticker   open     high     low  close  volume
0       20090824      A  25.64  25.7400  25.330  25.50   22247
1       20090825      A  25.50  25.7000  25.225  25.34   30891
2       20090826      A  25.32  25.6425  25.145  25.48   33334
3       20090827      A  25.50  25.5700  25.230  25.54   70176
4       20090828      A  25.67  26.0500  25.630  25.83   39694
...          ...    ...    ...      ...     ...    ...     ...
122568  20100813    ZMH  51.72  51.9000  51.380  51.44   14561
122569  20100816    ZMH  51.13  51.4700  50.600  51.00   13489
122570  20100817    ZMH  51.14  51.6000  50.890  51.21   20498
122571  20100819    ZMH  51.63  51.6300  50.170  50.22   18259
122572  20100820    ZMH  50.03  50.5500  49.480  49.82   17792

[122573 rows x 7 columns]

In [ ]:
sp500 = pd.read_csv('sp500hst.txt', sep=",", header=None)
sp500.columns = ["date", "ticker", "open", "high", "low", "close", "volume"]
sp500.groupby(['ticker'])[['volume']].sum()

          volume
ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
...          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916

[524 rows x 1 columns]

2. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

In [ ]:
sp_data2 = pd.read_csv('sp_data2.csv', sep=';', header=None)
sp_data2.columns = ["ticker", "decryption", "percentage"]
sp_data2

    ticker       decryption percentage
0     AAPL            Apple       3.6%
1     AMZN       Amazon.com       3.2%
2    GOOGL         Alphabet       3.1%
3     GOOG         Alphabet       3.1%
4     MSFT        Microsoft       3.0%
..     ...              ...        ...
500    SCG            SCANA       0.0%
501    AIZ         Assurant       0.0%
502    AYI    Acuity Brands       0.0%
503    HRB        H&R Block       0.0%
504    RRC  Range Resources       0.0%

[505 rows x 3 columns]

In [ ]:
sp500 = sp500.merge(sp_data2[['ticker','decryption']],how = "inner")
sp500

           date ticker   open  ...  close  volume            decryption
0      20090821      A  25.60  ...  25.55   34758  Agilent Technologies
1      20090824      A  25.64  ...  25.50   22247  Agilent Technologies
2      20090825      A  25.50  ...  25.34   30891  Agilent Technologies
3      20090826      A  25.32  ...  25.48   33334  Agilent Technologies
4      20090827      A  25.50  ...  25.54   70176  Agilent Technologies
...         ...    ...    ...  ...    ...     ...                   ...
82167  20100813   ZION  20.17  ...  19.89   25193         Zions Bancorp
82168  20100816   ZION  19.81  ...  19.95   25914         Zions Bancorp
82169  20100817   ZION  20.07  ...  20.31   31717         Zions Bancorp
82170  20100819   ZION  19.83  ...  19.35   45935         Zions Bancorp
82171  20100820   ZION  19.15  ...  19.14   37225         Zions Bancorp

[82172 rows x 8 columns]

## Лабораторная работа №2.2

### Группировки таблиц `pd.DataFrame`

4.1 Посчитайте количество рецептов, представленных каждым из участников (`contributor_id`). Какой участник добавил максимальное кол-во рецептов?

In [ ]:
recipes = pd.read_csv('recipes_sample.csv')
reviews= pd.read_csv('reviews_sample.csv')
recipes.head(-10)

                                                    name  ...  n_ingredients
0                  george s at the cove  black bean soup  ...           18.0
1                     healthy for them  yogurt popsicles  ...            NaN
2                           i can t believe it s spinach  ...            8.0
3                                   italian  gut busters  ...            NaN
4               love is in the air  beef fondue   sauces  ...            NaN
...                                                  ...  ...            ...
29985  zucchini  pineapple  ginger jam kicked up with...  ...            8.0
29986                 zucchini  potato and herb fritters  ...           12.0
29987    zucchini carrot cake with cream cheese frosting  ...           15.0
29988                            zucchini carrot muffins  ...           13.0
29989                         zucchini cheddar casserole  ...            8.0

[29990 rows x 8 columns]

In [ ]:
n_recipes_by_contributor = recipes.groupby('contributor_id')['id'].count()

assert n_recipes_by_contributor.sum() == recipes.shape[0]

print(f'Кол-во рецептов, представленных участником:\n{n_recipes_by_contributor}')
print(f'\nМаксимальное кол-во рецептов добавил: contributor_id = {n_recipes_by_contributor.argmax()}')

Кол-во рецептов, представленных участником:
contributor_id
1530            5
1533          186
1534           50
1535           40
1538            8
             ...
2001968497      2
2002059754      1
2002234079      1
2002234259      1
2002247884      1
Name: id, Length: 8404, dtype: int64

Максимальное кол-во рецептов добавил: contributor_id = 1768

4.2 Посчитайте средний рейтинг к каждому из рецептов. Для скольких рецептов отсутствуют отзывы?

In [ ]:
recipes_reviews = recipes.merge(reviews, how='left', left_on='id', right_on='recipe_id')
groupby_recipe = recipes_reviews.groupby('id')

mean_recipe_ratings = groupby_recipe['rating'].mean()
n_recipes_without_review = (groupby_recipe['review'].size() - groupby_recipe['review'].count()).sum()

print(f'Средний рейтинг:\n{mean_recipe_ratings}')
print(f'\nКол-во рецептов без отзывов: {n_recipes_without_review} штук' )

Средний рейтинг:
id
48        1.000000
55        4.750000
66        4.944444
91        4.750000
94        5.000000
            ...
536547    5.000000
536610    0.000000
536728    4.000000
536729    4.750000
536747    0.000000
Name: rating, Length: 30000, dtype: float64

Кол-во рецептов без отзывов: 1917 штук

4.3 Посчитайте количество рецептов с разбивкой по годам создания.

In [ ]:
recipes.groupby(pd.to_datetime(recipes['submitted'], format='%Y-%m-%d', errors='ignore').dt.year)[['id']].count()

             id
submitted
1999        275
2000        104
2001        589
2002       2644
2003       2334
2004       2153
2005       3130
2006       3473
2007       4429
2008       4029
2009       2963
2010       1538
2011        922
2012        659
2013        490
2014        139
2015         42
2016         24
2017         39
2018         24

### Объединение таблиц `pd.DataFrame`

5.1 При помощи объединения таблиц, создайте `DataFrame`, состоящий из четырех столбцов: `id`, `name`, `user_id`, `rating`. Рецепты без отзывов должны отсутствовать в данной таблице. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и выведя на экран строку из полученного `DataFrame`, содержащую информацию об этом отзыве.

In [ ]:
recipes_reviews = pd.merge(recipes,reviews,how='inner',left_on='id',right_on='recipe_id')[['id', 'name', 'user_id', 'rating']]

recipe_without_review = pd.Series(list(set(recipes['id'].unique()) - set(reviews['recipe_id'].unique()))).sample(1).values[0]

print(f'\nDataFrame (id, name, user_id, rating):\n{recipes_reviews}')

DataFrame (id, name, user_id, rating):
            id                                    name  user_id  rating
0        44123   george s at the cove  black bean soup   743566       5
1        44123   george s at the cove  black bean soup    76503       5
2        44123   george s at the cove  black bean soup    34206       5
3        67664      healthy for them  yogurt popsicles   494084       5
4        67664      healthy for them  yogurt popsicles   303445       5
...        ...                                     ...      ...     ...
126691  486161                             zydeco soup   305531       5
126692  486161                             zydeco soup  1271506       5
126693  486161                             zydeco soup   724631       5
126694  486161                             zydeco soup   133174       5
126695  298512  cookies by design   cookies on a stick   804234       1

[126696 rows x 4 columns]

In [ ]:
recipes_reviews[recipes_reviews["id"] == recipe_without_review]

Empty DataFrame
Columns: [id, name, user_id, rating]
Index: []

5.2 При помощи объединения таблиц и группировок, создайте `DataFrame`, состоящий из трех столбцов: `recipe_id`, `name`, `review_count`. У рецептов, для которых отсутствуют отзывы, в соответствущем столбце должен быть указан 0. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и выведя на экран строку из полученного `DataFrame`, содержащую информацию об этом отзыве.

Задание сделано на основе того, что review_count считается количество отзывов по рецептам

In [ ]:
grouped = reviews.groupby('recipe_id')['review'].count().reset_index()

recipes_reviews = pd.merge(recipes.rename(columns={'id': 'recipe_id'}),grouped.rename(columns={'review': 'review_count'}),how='left',on='recipe_id')[['recipe_id', 'name', 'review_count']].fillna({'review_count': 0})

recipe_without_review = pd.Series(list(set(recipes['id'].unique()) - set(reviews['recipe_id'].unique()))).sample(1).values[0]

recipes_reviews

       recipe_id                                          name  review_count
0          44123         george s at the cove  black bean soup           3.0
1          67664            healthy for them  yogurt popsicles           8.0
2          38798                  i can t believe it s spinach           3.0
3          35173                          italian  gut busters           1.0
4          84797      love is in the air  beef fondue   sauces           8.0
...          ...                                           ...           ...
29995     267661  zurie s holey rustic olive and cheddar bread           4.0
29996     386977          zwetschgenkuchen  bavarian plum cake           2.0
29997     103312   zwiebelkuchen   southwest german onion cake           6.0
29998     486161                                   zydeco soup           6.0
29999     298512        cookies by design   cookies on a stick           1.0

[30000 rows x 3 columns]

In [ ]:
recipes_reviews[recipes_reviews["recipe_id"] == recipe_without_review]

       recipe_id  ... review_count
11206     484664  ...          0.0

[1 rows x 3 columns]

5.3. Выясните, отзывы, добавленные в каком году, имеют наименьший средний рейтинг?

In [ ]:
df_reiting = reviews.groupby(pd.to_datetime(reviews['date'], format='%Y-%m-%d', errors='ignore').dt.year)[['rating']].mean()
df_reiting.idxmin()[0]

2017

### Сохранение таблиц `pd.DataFrame`

6.1 Отсортируйте таблицу в порядке убывания величины столбца `name_word_count` и сохраните результаты выполнения заданий 3.1-3.3 в csv файл.

In [ ]:
recipes["name_word_count"] = recipes["name"].str.split().str.len().sort_values(ascending = False)
recipes["description_length"] =recipes["description"].str.len()
recipes["description"].str.title()
recipes.sort_values(by=["name_word_count"], ascending = False)
recipes.to_csv('recipes_1.csv')

6.2 Воспользовавшись `pd.ExcelWriter`, cохраните результаты 5.1 и 5.2 в файл: на лист с названием `Рецепты с оценками` сохраните результаты выполнения 5.1; на лист с названием `Количество отзывов по рецептам` сохраните результаты выполнения 5.2.

In [ ]:
writer = pd.ExcelWriter('Five_one_and_two.xlsx')
recipes_reviews.to_excel(writer,'Рецепты с оценками')
recipes_reviews.to_excel(writer,'Количество отзывов по рецептам')
writer.save()